In [1]:
import pandas as pd

In [2]:
students = ['Alice','Jack','Molly']

In [3]:
pd.Series(students)

0    Alice
1     Jack
2    Molly
dtype: object

In [4]:
numbers = [1,2,3,4,5]

In [7]:
pd.Series(numbers)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
students = ['Alice','Jack',None]

In [10]:
pd.Series(students)

0    Alice
1     Jack
2     None
dtype: object

In [11]:
numbers = [1,2,None]

In [12]:
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [13]:
 import numpy as np

In [14]:
np.isnan(np.nan)

True

In [15]:
np.isnan(1)

False

In [27]:
student_scores = {'Alice':'Physics',
                 'Jack':'Chemistry',
                 'Molly':'English'}
s = pd.Series(student_scores)
s

Alice      Physics
Jack     Chemistry
Molly      English
dtype: object

In [28]:
"""index objec"""
s.index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [29]:
"""series """
s.keys

<bound method Series.keys of Alice      Physics
Jack     Chemistry
Molly      English
dtype: object>

In [30]:
students = [("Alice", "Brwon"),("Jack","White"),("Molly","Green")]
pd.Series(students)

0    (Alice, Brwon)
1     (Jack, White)
2    (Molly, Green)
dtype: object

In [31]:
#Separating your index creation from the data by passing in the index as a list explicitly to the series
s=pd.Series(['Phycis','Chemistry','English'], index = ['Alice','Jack','Molly'])

In [32]:
s

Alice       Phycis
Jack     Chemistry
Molly      English
dtype: object

## Query a Series

In [2]:
import pandas as pd

In [3]:
student_classes = {'Alice':'Physics',
                  'Jack':'Chemistry',
                  'Molly':'English',
                  'Sam':'History'}
s = pd.Series(student_classes)

In [4]:
s.iloc[3]

'History'

In [5]:
s.loc['Sam']

'History'

### DataFrame Data Structure

In [6]:
import pandas as pd

In [7]:
record1=pd.Series({'Name':'Alice',
         'Class':'Physics',
         'Score':85})
record2=pd.Series({'Name':'Jack',
         'Class':'Chemistry',
         'Score':82})
record3=pd.Series({'Name':'Helen',
         'Class':'Biology',
         'Score':90})

In [8]:
df = pd.DataFrame([record1,record2,record3],index=['school1','school2','school3'])

In [9]:
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
students=({'Name':'Alice',
         'Class':'Physics',
         'Score':85},
        {'Name':'Jack',
         'Class':'Chemistry',
         'Score':82},
        {'Name':'Helen',
         'Class':'Biology',
         'Score':90})

In [11]:
df = pd.DataFrame(students,index=['School1','School2','School1'])

In [12]:
df.head()

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School1  Helen    Biology     90

In [14]:
totalscore = df['Score'].summ

In [15]:
totalscore

<bound method NDFrame._add_numeric_operations.<locals>.sum of School1    85
School2    82
School1    90
Name: Score, dtype: int64>

In [28]:
df.loc['School1']

Name       Alice
Class    Physics
Score         85
Name: School1, dtype: object

In [30]:
type(df.loc['School2'])

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

In [34]:
df.loc['School1']

          Name    Class  Score
School1  Alice  Physics     85
School1  Helen  Biology     90

In [36]:
type(df.loc['School1'])

pandas.core.frame.DataFrame

In [37]:
df.loc['School2']['Name']

'Jack'

In [38]:
df.transpose()

       School1    School2  School1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [40]:
df.T

       School1    School2  School1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [42]:
df.T.loc['Name']

School1    Alice
School2     Jack
School1    Helen
Name: Name, dtype: object

In [46]:
df.loc['School1']

          Name    Class  Score
School1  Alice  Physics     85
School1  Helen  Biology     90

In [47]:
df['Name']

School1    Alice
School2     Jack
School1    Helen
Name: Name, dtype: object

In [48]:
df.loc['Name']

KeyError: 'Name'

In [52]:
df.loc['School1']['Name'] """data type: series"""

School1    Alice
School1    Helen
Name: Name, dtype: object

In [75]:
df.loc['School1'] """data type: dataframe"""

SyntaxError: invalid syntax (<ipython-input-75-6baa41740278>, line 1)

In [76]:
df['Name']"""data type: series"""

SyntaxError: invalid syntax (<ipython-input-76-c0f1aab113bf>, line 1)

In [77]:
type(df['Name'])"""data type: series"""

SyntaxError: invalid syntax (<ipython-input-77-d6eb21663f2b>, line 1)

In [85]:
df.loc[:,['Name','Score']]

          Name  Score
School1  Alice     85
School2   Jack     82
School1  Helen     90

In [86]:
copy_df=df.copy()

In [87]:
copy_df.drop("Name",inplace=True,axis=1) #when droping a column the axis == 1
copy_df

             Class  Score
School1    Physics     85
School2  Chemistry     82
School1    Biology     90

In [88]:
del copy_df["Class"]
copy_df

         Score
School1     85
School2     82
School1     90

In [89]:
copy_df['Assignment_class']=None

In [90]:
copy_df

         Score Assignment_class
School1     85             None
School2     82             None
School1     90             None

In [91]:
x = pd.Series(['Jack','Smack','Rack'])

In [93]:
x

0     Jack
1    Smack
2     Rack
dtype: object

In [95]:
x = pd.DataFrame(['Jack','Smack','Rack'])

In [96]:
x.head()

       0
0   Jack
1  Smack
2   Rack

## indexing and loading video

In [97]:
"""See video/workbook"""

'See video/workbook'

In [99]:
df= pd.read_csv("datasets/Admission_Predict.csv",index_col =0)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/Admission_Predict.csv'

## Missing values

## playing with a dummy dataset

In [150]:
import os
import pandas as pd
import numpy as np

In [151]:
os.getcwd()

'C:\\Users\\gregb\\OneDrive\\Documents\\courses\\coursera\\Uni_Mich_IntoToDataScienceInPython'

In [152]:
!type week2testdata.csv

airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
Aer Lingus,320906734,2,0,0,0,0,0
Aeroflot*,1197672318,76,14,128,6,1,88
Aerolineas Argentinas,385803648,6,0,0,1,0,0
Aeromexico*,596871813,3,1,64,5,0,0
Air Canada,1865253802,2,0,0,2,0,0
Air France,3004002661,14,4,79,6,2,337
Air India*,869253552,2,1,329,4,1,158
Air New Zealand*,710174817,3,0,0,5,1,7
Alaska Airlines*,965346773,5,0,0,5,1,88
Alitalia,698012498,7,2,50,4,0,0
All Nippon Airways,1841234177,3,1,1,7,0,0
American*,5228357340,21,5,101,17,3,416
Austrian Airlines,358239823,1,0,0,1,0,0
Avianca,396922563,5,3,323,0,0,0
British Airways*,3179760952,4,0,0,6,0,0
Cathay Pacific*,2582459303,0,0,0,2,0,0
China Airlines,813216487,12,6,535,2,1,225
Condor,417982610,2,1,16,0,0,0
COPA,550491507,3,1,47,0,0,0
Delta / Northwest*,6525658894,24,12,407,24,2,51
Egyptair,557699891,8,3,282,4,1,14
El Al,335448023,1,1,4,1,0,0
Ethiopian Airlines,488560643,25,5,167,5,2,92
Finnair,506464950,1,0,0,0,0,0
Garuda Indonesia,613356665,10,3,260,4,2,22
Gulf Air,301379762,1,0,0,3,1,143
Hawaiian Airlines,493877795,0,0,0,1,0,0
Iberia,1173203126,4,1,148,5,0,0
Japan Airlines,1574217531,3,1,520,0,0,0
Kenya Airways,277414794,2,0,0,2,2,283
KLM*,1874561773,7,1,3,1,0,0
Korean Air,1734522605,12,5,425,1,0,0
LAN Airlines,1001965891,3,2,21,0,0,0
Lufthansa*,3426529504,6,1,2,3,0,0
Malaysia Airlines,1039171244,3,1,34,3,2,537
Pakistan International,348563137,8,3,234,10,2,46
Philippine Airlines,413007158,7,4,74,2,1,1
Qantas*,1917428984,1,0,0,5,0,0
Royal Air Maroc,295705339,5,3,51,3,0,0
SAS*,682971852,5,0,0,6,1,110
Saudi Arabian,859673901,7,2,313,11,0,0
Singapore Airlines,2376857805,2,2,6,2,1,83
South African,651502442,2,1,159,1,0,0
Southwest Airlines,3276525770,1,0,0,8,0,0
Sri Lankan / AirLanka,325582976,2,1,14,4,0,0
SWISS*,792601299,2,1,229,3,0,0
TACA,259373346,3,1,3,1,1,3
TAM,1509195646,8,3,98,7,2,188
TAP - Air Portugal,619130754,0,0,0,0,0,0
Thai Airways,1702802250,8,4,308,2,1,1
Turkish Airlines,1946098294,8,3,64,8,2,84
United / Continental*,7139291291,19,8,319,14,2,109
US Airways / America West*,2455687887,16,7,224,11,2,23
Vietnam Airlines,625084918,7,3,171,1,0,0
Virgin Atlantic,1005248585,1,0,0,0,0,0
Xiamen Airlines,430462962,9,1,82,2,0,0

In [346]:
df = pd.read_csv('week2testdata.csv')
df.head()

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

In [347]:
new_df =df.rename(columns={'airline':'airline','avail_seat_km_per_week':'available seat','incidents_85_99':'incidents',
                          'fatal_accidents_85_99':'fatal_accidents','fatalities_85_99':'fatalities','incidents_00_14':'inci'
                          ,'fatal_accidents_00_14':'accidents','fatalities_00_14':'fatalities_00_14'})

In [348]:
df = new_df.rename(mapper=str.strip,axis='columns')

In [349]:
df.head()

,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

In [258]:
cols=list(df.columns)

In [259]:
cols

['airline',
 'available seat',
 'incidents',
 'fatal_accidents',
 'fatalities',
 'inci',
 'accidents',
 'fatalities_00_14']

In [260]:
cols=[x.lower().strip() for x in cols]

In [261]:
cols

['airline',
 'available seat',
 'incidents',
 'fatal_accidents',
 'fatalities',
 'inci',
 'accidents',
 'fatalities_00_14']

In [262]:
df.columns=cols

In [263]:
df.head()

,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

In [264]:
df[df['incidents'.upper()]>5].head()

KeyError: 'INCIDENTS'

In [207]:
df=(df['incidents'.upper()]>5) & (df['incidents'.upper()]<20)

In [208]:
df.head()

0    False
1    False
2     True
3    False
4    False
Name: INCIDENTS, dtype: bool

In [224]:
df['ACCIDENTS'.lower()].gt(1).lt(2)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
30    True
31    True
32    True
33    True
34    True
35    True
36    True
37    True
38    True
39    True
40    True
41    True
42    True
43    True
44    True
45    True
46    True
47    True
48    True
49    True
50    True
51    True
52    True
53    True
54    True
55    True
Name: accidents, dtype: bool

In [242]:
df['accidents']
df

Empty DataFrame
Columns: [index, airline, available seat, incidents, fatal_accidents, fatalities, inci, accidents, fatalities_00_14]
Index: []

In [228]:
df['airline'] = df.index

In [329]:
df = df.reset_index()

In [231]:
df

,index,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,0,0,320906734,2,0,0,0,0,0
1,1,1,1197672318,76,14,128,6,1,88
2,2,2,385803648,6,0,0,1,0,0
3,3,3,596871813,3,1,64,5,0,0
4,4,4,1865253802,2,0,0,2,0,0
5,5,5,3004002661,14,4,79,6,2,337
6,6,6,869253552,2,1,329,4,1,158
7,7,7,710174817,3,0,0,5,1,7
8,8,8,965346773,5,0,0,5,1,88
9,9,9,698012498,7,2,50,4,0,0
10,10,10,1841234177,3,1,1,7,0,0
11,11,11,5228357340,21,5,101,17,3,416
12,12,12,358239823,1,0,0,1,0,0
13,13,13,396922563,5,3,323,0,0,0
14,14,14,3179760952,4,0,0,6,0,0
15,15,15,2582459303,0,0,0,2,0,0
16,16,16,813216487,12,6,535,2,1,225
17,17,17,417982610,2,1,16,0,0,0
18,18,18,550491507,3,1,47,0,0,0
19,19,19,6525658894,24,12,407,24,2,51
20,20,20,557699891,8,3,282,4,1,14
21,21,21,335448023,1,1,4,1,0,0
22,22,22,488560643,25,5,167,5,2,92
23,23,23,506464950,1,0,0,0,0,0
24,24,24,613356665,10,3,260,4,2,22
25,25,25,301379762,1,0,0,3,1,143
26,26,26,493877795,0,0,0,1,0,0
27,27,27,1173203126,4,1,148,5,0,0
28,28,28,1574217531,3,1,520,0,0,0
29,29,29,277414794,2,0,0,2,2,283
30,30,30,1874561773,7,1,3,1,0,0
31,31,31,1734522605,12,5,425,1,0,0
32,32,32,1001965891,3,2,21,0,0,0
33,33,33,3426529504,6,1,2,3,0,0
34,34,34,1039171244,3,1,34,3,2,537
35,35,35,348563137,8,3,234,10,2,46
36,36,36,413007158,7,4,74,2,1,1
37,37,37,1917428984,1,0,0,5,0,0
38,38,38,295705339,5,3,51,3,0,0
39,39,39,682971852,5,0,0,6,1,110
40,40,40,859673901,7,2,313,11,0,0
41,41,41,2376857805,2,2,6,2,1,83
42,42,42,651502442,2,1,159,1,0,0
43,43,43,3276525770,1,0,0,8,0,0
44,44,44,325582976,2,1,14,4,0,0
45,45,45,792601299,2,1,229,3,0,0
46,46,46,259373346,3,1,3,1,1,3
47,47,47,1509195646,8,3,98,7,2,188
48,48,48,619130754,0,0,0,0,0,0
49,49,49,1702802250,8,4,308,2,1,1
50,50,50,1946098294,8,3,64,8,2,84
51,51,51,7139291291,19,8,319,14,2,109
52,52,52,2455687887,16,7,224,11,2,23
53,53,53,625084918,7,3,171,1,0,0
54,54,54,1005248585,1,0,0,0,0,0
55,55,55,430462962,9,1,82,2,0,0

In [265]:
df = df[df['inci']>8]

In [266]:
df.head()

,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
11,American*,5228357340,21,5,101,17,3,416
19,Delta / Northwest*,6525658894,24,12,407,24,2,51
35,Pakistan International,348563137,8,3,234,10,2,46
40,Saudi Arabian,859673901,7,2,313,11,0,0
51,United / Continental*,7139291291,19,8,319,14,2,109

In [279]:
df= df.set_index(['airline'])

KeyError: "None of ['airline'] are in the columns"

In [273]:
df

,,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
airline,incidents,,,,,,
American*,21,5228357340,5,101,17,3,416
Delta / Northwest*,24,6525658894,12,407,24,2,51
Pakistan International,8,348563137,3,234,10,2,46
Saudi Arabian,7,859673901,2,313,11,0,0
United / Continental*,19,7139291291,8,319,14,2,109
US Airways / America West*,16,2455687887,7,224,11,2,23

In [278]:
df.loc['American*','fatalities']

incidents
21    101
Name: fatalities, dtype: int64

In [345]:
df = df.reset_index()

ValueError: cannot insert level_0, already exists

In [344]:
df

,level_0,index,index,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14,splitairline
0,0,0,0,American*,21,5228357340,5,101,17,3,416,
1,1,1,1,Delta / Northwest*,24,6525658894,12,407,24,2,51,
2,2,2,2,Pakistan International,8,348563137,3,234,10,2,46,
3,3,3,3,Saudi Arabian,7,859673901,2,313,11,0,0,
4,4,4,4,United / Continental*,19,7139291291,8,319,14,2,109,
5,5,5,5,US Airways / America West*,16,2455687887,7,224,11,2,23,

In [285]:
df.loc['airline']

KeyError: 'airline'

In [290]:
df.loc[0]['airline']

'American*'

In [291]:
mask=df.isnull()

In [292]:
mask

,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False

In [294]:
df.fillna(0,inplace=True)

In [295]:
df

,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,American*,21,5228357340,5,101,17,3,416
1,Delta / Northwest*,24,6525658894,12,407,24,2,51
2,Pakistan International,8,348563137,3,234,10,2,46
3,Saudi Arabian,7,859673901,2,313,11,0,0
4,United / Continental*,19,7139291291,8,319,14,2,109
5,US Airways / America West*,16,2455687887,7,224,11,2,23

In [297]:
df['splitairline'] = df['airline']

In [310]:
df['splitairline'] = df['splitairline'].replace("[\w].*\"," ",regex=True)

SyntaxError: EOL while scanning string literal (<ipython-input-310-9c8f4fda56c0>, line 1)

In [311]:
df

,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14,splitairline
0,American*,21,5228357340,5,101,17,3,416,
1,Delta / Northwest*,24,6525658894,12,407,24,2,51,
2,Pakistan International,8,348563137,3,234,10,2,46,
3,Saudi Arabian,7,859673901,2,313,11,0,0,
4,United / Continental*,19,7139291291,8,319,14,2,109,
5,US Airways / America West*,16,2455687887,7,224,11,2,23,

# Quiz2

In [312]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [313]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [314]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [315]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [316]:
obj3['California']

True

In [317]:
obj2['California'] == None

False

In [321]:
x = obj2['California']
obj2['California'] != x

True

In [320]:
type(obj2['California'])

numpy.float64

In [322]:
type(x)

numpy.float64

In [323]:
import pandas as pd
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)

In [324]:

S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [325]:
S.loc[0:3]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [338]:

df.rename(mapper = lambda x: x.lower(), axis = 1, inplace = True)

In [339]:
df

,index,index,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14,splitairline
0,0,0,American*,21,5228357340,5,101,17,3,416,
1,1,1,Delta / Northwest*,24,6525658894,12,407,24,2,51,
2,2,2,Pakistan International,8,348563137,3,234,10,2,46,
3,3,3,Saudi Arabian,7,859673901,2,313,11,0,0,
4,4,4,United / Continental*,19,7139291291,8,319,14,2,109,
5,5,5,US Airways / America West*,16,2455687887,7,224,11,2,23,

In [340]:
df.where(df['accidents'] > 2)

,index,index,airline,incidents,available seat,fatal_accidents,fatalities,inci,accidents,fatalities_00_14,splitairline
0,0.0,0.0,American*,21.0,5.228357e+09,5.0,101.0,17.0,3.0,416.0,
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [351]:
df.reset_index()

,index,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
0,0,Aer Lingus,320906734,2,0,0,0,0,0
1,1,Aeroflot*,1197672318,76,14,128,6,1,88
2,2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,3,Aeromexico*,596871813,3,1,64,5,0,0
4,4,Air Canada,1865253802,2,0,0,2,0,0
5,5,Air France,3004002661,14,4,79,6,2,337
6,6,Air India*,869253552,2,1,329,4,1,158
7,7,Air New Zealand*,710174817,3,0,0,5,1,7
8,8,Alaska Airlines*,965346773,5,0,0,5,1,88
9,9,Alitalia,698012498,7,2,50,4,0,0
10,10,All Nippon Airways,1841234177,3,1,1,7,0,0
11,11,American*,5228357340,21,5,101,17,3,416
12,12,Austrian Airlines,358239823,1,0,0,1,0,0
13,13,Avianca,396922563,5,3,323,0,0,0
14,14,British Airways*,3179760952,4,0,0,6,0,0
15,15,Cathay Pacific*,2582459303,0,0,0,2,0,0
16,16,China Airlines,813216487,12,6,535,2,1,225
17,17,Condor,417982610,2,1,16,0,0,0
18,18,COPA,550491507,3,1,47,0,0,0
19,19,Delta / Northwest*,6525658894,24,12,407,24,2,51
20,20,Egyptair,557699891,8,3,282,4,1,14
21,21,El Al,335448023,1,1,4,1,0,0
22,22,Ethiopian Airlines,488560643,25,5,167,5,2,92
23,23,Finnair,506464950,1,0,0,0,0,0
24,24,Garuda Indonesia,613356665,10,3,260,4,2,22
25,25,Gulf Air,301379762,1,0,0,3,1,143
26,26,Hawaiian Airlines,493877795,0,0,0,1,0,0
27,27,Iberia,1173203126,4,1,148,5,0,0
28,28,Japan Airlines,1574217531,3,1,520,0,0,0
29,29,Kenya Airways,277414794,2,0,0,2,2,283
30,30,KLM*,1874561773,7,1,3,1,0,0
31,31,Korean Air,1734522605,12,5,425,1,0,0
32,32,LAN Airlines,1001965891,3,2,21,0,0,0
33,33,Lufthansa*,3426529504,6,1,2,3,0,0
34,34,Malaysia Airlines,1039171244,3,1,34,3,2,537
35,35,Pakistan International,348563137,8,3,234,10,2,46
36,36,Philippine Airlines,413007158,7,4,74,2,1,1
37,37,Qantas*,1917428984,1,0,0,5,0,0
38,38,Royal Air Maroc,295705339,5,3,51,3,0,0
39,39,SAS*,682971852,5,0,0,6,1,110
40,40,Saudi Arabian,859673901,7,2,313,11,0,0
41,41,Singapore Airlines,2376857805,2,2,6,2,1,83
42,42,South African,651502442,2,1,159,1,0,0
43,43,Southwest Airlines,3276525770,1,0,0,8,0,0
44,44,Sri Lankan / AirLanka,325582976,2,1,14,4,0,0
45,45,SWISS*,792601299,2,1,229,3,0,0
46,46,TACA,259373346,3,1,3,1,1,3
47,47,TAM,1509195646,8,3,98,7,2,188
48,48,TAP - Air Portugal,619130754,0,0,0,0,0,0
49,49,Thai Airways,1702802250,8,4,308,2,1,1
50,50,Turkish Airlines,1946098294,8,3,64,8,2,84
51,51,United / Continental*,7139291291,19,8,319,14,2,109
52,52,US Airways / America West*,2455687887,16,7,224,11,2,23
53,53,Vietnam Airlines,625084918,7,3,171,1,0,0
54,54,Virgin Atlantic,1005248585,1,0,0,0,0,0
55,55,Xiamen Airlines,430462962,9,1,82,2,0,0

In [353]:
df.where(df['accidents'] >1).dropna()

,airline,available seat,incidents,fatal_accidents,fatalities,inci,accidents,fatalities_00_14
5,Air France,3.004003e+09,14.0,4.0,79.0,6.0,2.0,337.0
11,American*,5.228357e+09,21.0,5.0,101.0,17.0,3.0,416.0
19,Delta / Northwest*,6.525659e+09,24.0,12.0,407.0,24.0,2.0,51.0
22,Ethiopian Airlines,4.885606e+08,25.0,5.0,167.0,5.0,2.0,92.0
24,Garuda Indonesia,6.133567e+08,10.0,3.0,260.0,4.0,2.0,22.0
29,Kenya Airways,2.774148e+08,2.0,0.0,0.0,2.0,2.0,283.0
34,Malaysia Airlines,1.039171e+09,3.0,1.0,34.0,3.0,2.0,537.0
35,Pakistan International,3.485631e+08,8.0,3.0,234.0,10.0,2.0,46.0
47,TAM,1.509196e+09,8.0,3.0,98.0,7.0,2.0,188.0
50,Turkish Airlines,1.946098e+09,8.0,3.0,64.0,8.0,2.0,84.0
51,United / Continental*,7.139291e+09,19.0,8.0,319.0,14.0,2.0,109.0
52,US Airways / America West*,2.455688e+09,16.0,7.0,224.0,11.0,2.0,23.0

In [355]:
record1 = ({'Name':'Alice',
           'Class':'Physics',
           'Score':85})
record2 = ({'Name':'Jack',
           'Class':'Chemistry',
           'Score':82})

In [356]:
new_df = pd.DataFrame([record1,record2,record3])

In [357]:
new_df

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [365]:
new_df.reset_index

<bound method DataFrame.reset_index of     Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90>

In [366]:
new_df

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [368]:
new_df.drop('Class',axis=1)

    Name  Score
0  Alice     85
1   Jack     82
2  Helen     90

In [369]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [370]:
s2.iloc[1]

2

In [371]:
s2[1]

2

In [372]:

s1.loc[1]

'Alice'

In [373]:

s2.loc[1]

KeyError: 1

In [374]:
s = pd.Series({1:'Key1',2:'Key2',3:'Key3'})

In [375]:
s

1    Key1
2    Key2
3    Key3
dtype: object

In [376]:
type(s)

pandas.core.series.Series

In [380]:
for x in s.iteritems():
    print (x)

(1, 'Key1')
(2, 'Key2')
(3, 'Key3')

In [382]:
s1=pd.Series({4:'Key4',5:'Key5',6:'Key6'})

In [383]:
s.append(s1)

1    Key1
2    Key2
3    Key3
4    Key4
5    Key5
6    Key6
dtype: object

In [385]:
new_df

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [387]:

new_df[(new_df['Score'] > 85) & (new_df['Score'] < 100)]

    Name    Class  Score
2  Helen  Biology     90

In [389]:
new_df[(new_df['Score'].isin(range(85, 100)))]

    Name    Class  Score
0  Alice  Physics     85
2  Helen  Biology     90

In [392]:
new_df[new_df['Score'].gt(80) & new_df['Score'].lt(100)]

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [409]:
new_df.reindex()

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [412]:
new_df

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [414]:
new_df.where(new_df['Score'] > 85)

    Name    Class  Score
0    NaN      NaN    NaN
1    NaN      NaN    NaN
2  Helen  Biology   90.0

In [415]:

new_df[new_df['Score'] > 85]

    Name    Class  Score
2  Helen  Biology     90

In [421]:
df = pd.DataFrame({'gre score':[337,324,316,322,314],'toefl score':[118,107,104,110,103]})

In [422]:
df

   gre score  toefl score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [423]:
df.where(df['toefl score'] > 105).dropna()

   gre score  toefl score
0      337.0        118.0
1      324.0        107.0
3      322.0        110.0

In [424]:

df[df['toefl score'] > 105]

   gre score  toefl score
0        337          118
1        324          107
3        322          110

In [425]:

df.where(df['toefl score'] > 105)

   gre score  toefl score
0      337.0        118.0
1      324.0        107.0
2        NaN          NaN
3      322.0        110.0
4        NaN          NaN